# IFC_DMIsPSetEnabled

## Description
Check if a PSet for specified Object's IfcEntry is Enabled.

```pascal
FUNCTION IFC_DMIsPSetEnabled(
				strObjectName : STRING;
				strEntryName  : STRING;
				strPSetName   : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMIsPSetEnabled(strObjectName, strEntryName, strPSetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strObjectName|STRING||
|strEntryName|STRING||
|strPSetName|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* IFC